app/views/administrator/_orders.html.erb

         <li class="col m1"> <%= order.id %></li>
         <li class="col m2"><%= order.user.first_name %></li>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

         <tbody>
           <% order.order_items.each do |order_item| %>
           <% product = Product.find_by(order_item.product_id) %>
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 6
SELECT  `products`.* FROM `products` WHERE (1) LIMIT 1