app/controllers/administrator_controller.rb

SELECT  `orders`.* FROM `orders`  ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `orders`
---
  def show
    @orders = Order.all.paginate(page: params[:page], per_page: 10)

SELECT `products`.* FROM `products`  ORDER BY `products`.`created_at` DESC
---
  def product_index
    @products = Product.all.order(created_at: :desc)

SELECT  `users`.* FROM `users`  ORDER BY `users`.`created_at` DESC LIMIT 10 OFFSET 0
---
  def user_index
    @users = User.all.paginate(page: params[:page],
                               per_page: 10).order(created_at: :desc)